hare-siterwell/STM32PRO_RTX5/SYSTEM/Inc/sys.h
#ifndef __SYS_H
#define __SYS_H

#include "stm32f4xx_hal.h"  // SYSTEM适配
#define SYSTEM_SUPPORT_OS 1 // 是否支持OS

#if SYSTEM_SUPPORT_OS
#include "cmsis_os2.h" // 支持RTX5
#endif

/* 定义一些常用的数据类型短关键字 */
typedef int32_t s32;
typedef int16_t s16;
typedef int8_t s8;

typedef const int32_t sc32;
typedef const int16_t sc16;
typedef const int8_t sc8;

typedef __IO int32_t vs32;
typedef __IO int16_t vs16;
typedef __IO int8_t vs8;

typedef __I int32_t vsc32;
typedef __I int16_t vsc16;
typedef __I int8_t vsc8;

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t u8;

typedef const uint32_t uc32;
typedef const uint16_t uc16;
typedef const uint8_t uc8;

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t vu8;

typedef __I uint32_t vuc32;
typedef __I uint16_t vuc16;
typedef __I uint8_t vuc8;

typedef enum { false, true } bool;

/* 以下为汇编函数 */
void WFI_SET(void);      // 执行WFI指令
void INTX_DISABLE(void); // 关闭所有中断
void INTX_ENABLE(void);  // 开启所有中断
void MSR_MSP(u32 addr);  // 设置堆栈地址

#endif /* __SYS_H */
